{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_000", "text": "Privacy & Law Essentials of design and patent law Business March 17, 2025 March 21st, 2025 Learning objectives You... − know the main features of the provisions of the Design Act and the Patents Act − know the protection requirements for designs and patents − are aware of the registration and term of protection of designs and patents March 17, 2025 Page 2 Design law: Legal basis (Article 1 Designs Act) − The legal basis for the protection of designs is the Designs Act (DesA). − In the legal sense, design is understood to be the exterior form of a product or parts of it. − It can be either two-dimensional (a pattern) or three-dimensional. − Its form is characterised by the arrangement of lines, contours, colours and surfaces or by the material used. − Examples of three-dimensional designs include e.g. cutlery, toothbrushes, chairs, lamps or locomotives. − Examples of two-dimensional designs include e.g. watch faces or bottle labels. March 17, 2025 Page 3 Design law: Protection and advantages Why protect designs? Design appeals to our senses, evokes feelings, creates identity and distinguishes itself. This is why design has become one of the most crucial market factors and why counterfeiting is subsequently a frequent occurrence in this field. What are the practical advantages? − Owners of a design right can prevent others from using products with the same or a similar design.", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 0, "page": 1}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_001", "text": "creates identity and distinguishes itself. This is why design has become one of the most crucial market factors and why counterfeiting is subsequently a frequent occurrence in this field. What are the practical advantages? − Owners of a design right can prevent others from using products with the same or a similar design. − “Using” means in particular the manufacturing, storing, offering, putting on the market, importing, exporting or transiting of such products as well as simply being in possession of them. − The import, export and transiting of commercially produced goods can also be prohibited if they are for private use. March 17, 2025 Page 4 Design law: Protection requirements 1. Novelty − Is is not yet known in Switzerland − It was not presented to an open, numerically unlimited group of people. 2. Peculiarity − There must be a distinction from previous similar designs − A lower requirement for originality is required than for copyright (\"individuality\"). 3. No reasons for exclusion such as − technical function − infringement of laws and treaties − contrary to public policy or morality March 17, 2025 Page 5 Design law: Protection requirement «Novelty» 1. Novelty The design is new, which is the case when no other identical or similar design has been published before application. A design is not new if an identical design which could be known to the circles specialised in the relevant sector in Switzerland has been made available to the public", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 1, "page": 1}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_002", "text": "1. Novelty The design is new, which is the case when no other identical or similar design has been published before application. A design is not new if an identical design which could be known to the circles specialised in the relevant sector in Switzerland has been made available to the public prior to the filing date. No examination by the IPI of the design regarding newness or distinctiveness at registration. March 17, 2025 Page 6 Design law: Protection requirements “Peculiarity” and “No reasons for exlusion” 2. Peculiarity The design is sufficiently different from existing designs in major characteristics. A design does not have individual character if the overall impression it produces differs only in immaterial features from a design that could be known to the circles specialised in the relevant sector in Switzerland. 3. No reasons for exlusion A design may not be protected if: − the features of the design are dictated solely by the technical function of the product; E.g. the threads on a screw − the design infringes federal law or international treaties; E.g. violation of coats of arms − the design is contrary to public policy or morality. March 17, 2025 Page 7 Design law: Import of infringed designs March 17, 2025 Page 8 Design law: Registration for Switzerland (1/2) − Registration for Switzerland: Swiss Federal Institute of Intellectual Property (IPI) − Submussion of a design", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 2, "page": 2}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_003", "text": "17, 2025 Page 7 Design law: Import of infringed designs March 17, 2025 Page 8 Design law: Registration for Switzerland (1/2) − Registration for Switzerland: Swiss Federal Institute of Intellectual Property (IPI) − Submussion of a design application to the IPI. Application forms can be downloaded from www.ipi.ch/download-en − The registration should contain at least one illustration of your design suitable for reproduction. − Following registration, the design will be published on www.swissreg.ch. − Fees (www.ige.ch) − Guide for registering a design − E.g. Registration of a graphic design (No. 142861) or a backpack (No. 144301) March 17, 2025 Page 9 Design law: Registration for Switzerland (2/2) − The design right arises with the entry in the design register. − Filing priority: The design right belongs to the first filer of the design. − The person who created the design, his legal successor or a third party who owns the right for another legal reason is entitled to deposit the design. March 17, 2025 Page 10 Design law: International registration Designs can be registered in other countries in two ways. 1. Applying directly to the country concerned. Be aware that the legal basis, filing formalities as well as examination and granting procedures vary from country to country. 2. Several countries with one application.", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 3, "page": 2}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_004", "text": "10 Design law: International registration Designs can be registered in other countries in two ways. 1. Applying directly to the country concerned. Be aware that the legal basis, filing formalities as well as examination and granting procedures vary from country to country. 2. Several countries with one application. − At the World Intellectual Property Organization (WIPO, www.wipo.int) in Geneva for countries that are members of the Hague Agreement. − At the European Union Intellectual Property Office (EUIPO, www.euipo.europa.eu) in Alicante, Spain, for the whole European Union area. March 17, 2025 Page 11 Design law: Example of a registred design Air humidifier Martin Stadler, Zug DM/047573 1. Novelty? 2. Peculiarity? 3. No reasons for exclusion? March 17, 2025 Page 12 Design law: Nice to know Alternatives to design protection: A design can also fall under the protection of copyright or be protected as a trademark (three-dimensional figurative trademark) provided that the requirements for copyright or trademark protection have been fulfilled. Protection is independent of the dimensions i.e. a scale model enjoys the same protection as the original. This is why no measurements should be given in the illustrations. March 17, 2025 Page 13 Design law: Term of protection − 5 years from the filing date − Possibility of extension by 4 periods of protection", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 4, "page": 3}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_005", "text": "a scale model enjoys the same protection as the original. This is why no measurements should be given in the illustrations. March 17, 2025 Page 13 Design law: Term of protection − 5 years from the filing date − Possibility of extension by 4 periods of protection of 5 years each − Maximum design protection: 25 years − The period of protection begins on the day of filing the application. March 17, 2025 Page 14 Patent law: Purpose − Patent law protects inventions and grants the owner the exclusive right to exploit the invention protected by the patent commercially. − This also means that the patent proprietor may prohibit all others from using the same invention. − The protection of inventions is intended to promote technical progress in two respects: − On the one hand, the patent provides a basis and incentive for investment in research and development, since inventions are protected and rewarded by the patent. − On the other hand, the description of the invention in the patent specification is publicly accessible, which in turn is intended to promote innovation. March 17, 2025 Page 15 Patent law: What is a patent? − A patent is an exclusive right granted by the Swiss government for an invention in all fields of technology. − Patent eligibility: an invention (in the legal sense) is a technical solution to a technical problem. − Patentability: for an invention to be patentable, it must be: 1. useful (= can be commercially used / industrial", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 5, "page": 3}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_006", "text": "the Swiss government for an invention in all fields of technology. − Patent eligibility: an invention (in the legal sense) is a technical solution to a technical problem. − Patentability: for an invention to be patentable, it must be: 1. useful (= can be commercially used / industrial application) 2. a novelty 3. non-obvious to a person skilled in the art Inventions include: − products (e.g. heatable ski boots, chemical compounds such as aspirin) − processes (e.g. a process for freeze-drying coffee) March 17, 2025 Page 16 Patent law: Protection requirements (1/2) 1. “Useful” = Industrial application The invention must be manufacturable or applicable in some commercial sector. 2. Novelty The invention must be novel. An invention is novel when it is not already part of the prior art. Any knowledge which is publicly accessible in any form, in any part of the world, before an application for a patent has been filed is considered prior art. March 17, 2025 Page 17 Patent law: Protection requirements (2/2) 3. Non-obvious − Inventive step – the invention must not result from the prior art in an obvious way and thus be trivial for a person skilled in the art. − Unexpected features of a product or the refutation of a prejudice (i.e. “this can’t be done”) are often indications that", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 6, "page": 4}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_007", "text": "− Inventive step – the invention must not result from the prior art in an obvious way and thus be trivial for a person skilled in the art. − Unexpected features of a product or the refutation of a prejudice (i.e. “this can’t be done”) are often indications that there is an inventive step. March 17, 2025 Page 18 Patent law: First file, then talk! − Keep your invention secret as long as you have not applied for a patent. If you make your invention public in any form before you apply for a patent, it is no longer patentable! − To be patentable, an invention must be novel. An invention is novel when it has not been made available to the public anywhere in the world before the application date. If you expose your invention at an exhibit or in a scientific publication before you file your patent application, it becomes so-called \"prior art\" (as of “state of the art”) and is no longer considered novel when you apply for a patent. − Exception: Non-harmful disclosure with 6-month time limit − Evident abuse, e.g. breach of secrecy − Display at an officially recognized international exhibition − If you want to patent your invention or protect the design of your product, do not put your website online until you've filed for protection. Publishing information about your product destroys the novelty of it and makes the invention or design ineligible for protection. March 17, 2025 Page 19", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 7, "page": 4}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_008", "text": "exhibition − If you want to patent your invention or protect the design of your product, do not put your website online until you've filed for protection. Publishing information about your product destroys the novelty of it and makes the invention or design ineligible for protection. March 17, 2025 Page 19 Patent law: Alternatives to patent protection? − Keep the invention secret is the cheapest form of protection. Date the drawings and plans, put them in a sealed envelope, and then mail them to yourself (do not open the envelope!). You can also have the documents notarized. That way, in the event a conflict arises at a later date, you will be able to prove the date of your invention (e.g., the steps in your inventive process). − In industries with very fast development cycles, patent protection is maybe not necessary, as by the time competitors have copied the product, you will already be bringing the next product generation to the market. − Defensive publication: If you do not want to protect your invention but at the same time want to prevent third parties from patenting it, you can make your invention public. In this way, it is no longer considered novel and therefore not patentable. − Publication date in the internet − Details at www.protegas.com March 17, 2025 Page 20 Patent law: Limitations Ideas, concepts, discoveries, scientific theories and mathematical solutions, algorithms, game rules, lottery systems, teaching methods and organisational work flows,", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 8, "page": 5}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_009", "text": "patentable. − Publication date in the internet − Details at www.protegas.com March 17, 2025 Page 20 Patent law: Limitations Ideas, concepts, discoveries, scientific theories and mathematical solutions, algorithms, game rules, lottery systems, teaching methods and organisational work flows, diagnostic procedures, therapies and surgical procedures (on either humans or animals), plant varieties and animal breeds are not patentable. Computer programs as such are also not patentable; they are protected under copyright. Inventions which depend on a computer program, however, are patentable (e.g. electronic control). Also excluded from patentability are inventions whose utilisation would violate public order or public morality (for example, certain biotechnological inventions). March 17, 2025 Page 21 Patent law: Employee inventions (1/2) «Service inventions» are inventions of the employee which he or she makes during the performance of official duties and in fulfilment of a contractual obligation, or in the production of which he or she participates (Art. 332 para. 1 CO). Ownership with employer. There is no entitlement to financial compensation from the employer. «Occasional inventions» are inventions made by an employee in the course of his employment but outside his contractual obligations. − Without agreement: rights with the inventor (employee) (Art. 332 para. 2 CO). − With prior (!) agreement: Acquisition by employer possible for appropriate compensation", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 9, "page": 6}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_010", "text": "«Occasional inventions» are inventions made by an employee in the course of his employment but outside his contractual obligations. − Without agreement: rights with the inventor (employee) (Art. 332 para. 2 CO). − With prior (!) agreement: Acquisition by employer possible for appropriate compensation (Art. 332 para. 2 CO). Deadline 6 months. − Circumstances for determining the appropriate compensation − the economic value of the employee invention, − the cooperation of the employer, − the use of auxiliary staff and the employee's expenses, and − its position in the company (Art. 332 para. 4 CO). March 17, 2025 Page 22 Patent law: Employee inventions (2/2) The «free invention» is not made during the performance of official duties and therefore also not during the fulfilment of contractual obligations. The invention therefore has no material connection with the contractual work activity.  The property originates from the inventor, i.e. the employee.  If the employee offers the free invention to the employer, this must be done on reasonable terms (Art. 332 para. 4 CO), as in the case of occasional invention. March 17, 2025 Page 23 Patent law: case employee inventions Mr. Meier is a mechanic and has to repair machines in the company. During working hours, Mr. Meier comes up with a brilliant idea of how these machines could be improved so", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 10, "page": 6}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_011", "text": "the case of occasional invention. March 17, 2025 Page 23 Patent law: case employee inventions Mr. Meier is a mechanic and has to repair machines in the company. During working hours, Mr. Meier comes up with a brilliant idea of how these machines could be improved so that no more such repairs would be necessary. What kind employee invention does this trigger? March 17, 2025 Page 24 Patent Law: Registration − Registration principle: an invention only obtains patent protection if it is formally registered as a patent. − Patent protection is territorial − National application for national patents: IPI − «CH 123456» − The patent application is published on www.swissreg.ch 18 months after filing − The patent examination does not include novelty nor non-obviousness. − Application to the European Patent Office (EPO) for a European Patent − «EP 00123456» − The patent examination does include novelty and non-obviousness. − PCT application for a national and/or European and/or international patent (www.wipo.int) − The World Intellectual Property Organization (WIPO) in Geneva offers an international patent application process, which is based on the so-called Patent Cooperation Treaty (PCT). March 17, 2025 Page 25 Patent Law: Term of protection Inventions may be protected for a maximum of 20 years beginning from the date of the patent application. − Exception: Supplementary protection certificate of +5 years for medicinal", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 11, "page": 7}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_012", "text": "on the so-called Patent Cooperation Treaty (PCT). March 17, 2025 Page 25 Patent Law: Term of protection Inventions may be protected for a maximum of 20 years beginning from the date of the patent application. − Exception: Supplementary protection certificate of +5 years for medicinal products and plant protection products, due to long approval procedure In order to maintain protection, the owner must pay annual fees from the fourth year following the date of filing. March 17, 2025 Page 26 Patent law: Example of a patent application / «drop stop» Description of the invention Sufficient detail to allow a third party with average expertise to apply or reproduce the invention Pictorial material Drawings, plans, diagrams Patent claims The invention is defined in the patent claims and thus the material scope of the patent is determined. The independent patent claim defines the outer limit of the scope of protection and must contain all features essential for the invention. Each specification of a patent claim is defined in a subsequent dependent patent claim. This thus concerns the particular form of implementation (or execution) of the invention. March 17, 2025 Page 27 IP Law: wrap up (1/2) − While copyright protection automatically comes into existence with the creation of an original work, protection for trademarks, patents and designs must be applied for and periodically renewed. These requests are subject to certain conditions and formal regulations. − “First come, first served.” IP rights belong to whoever registers their", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 12, "page": 7}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_013", "text": "− While copyright protection automatically comes into existence with the creation of an original work, protection for trademarks, patents and designs must be applied for and periodically renewed. These requests are subject to certain conditions and formal regulations. − “First come, first served.” IP rights belong to whoever registers their trademark, invention or design first. − IP rights are granted without any guarantee. In Switzerland, for example, inventions are not examined for novelty. − As a prerequisite for novelty, patents and designs should undoubtedly be registered before their release into the public domain (for example, by selling, at an exhibition fair or on the internet). − IP rights expire following a maximum term of protection. Expired IP rights i.e. those that have been deleted after the maximum period of validity or have been withdrawn, are freely available. Exceptions to this are trademarks which can be renewed as often as required. March 17, 2025 Page 28 IP Law: wrap up (2/2) − IP rights are only valid in a certain country (the principle of territoriality). A trademark registered in Switzerland is therefore only protected in Switzerland. If the trademark should also be protected in other countries, then you must register it there too. − Generally, only the commercial exploitation of an invention or creation is protected. − The scope of protection is precisely defined. There are clear regulations that define the scope of protection for every IP right. For example, a trademark is not protected in general but only for those classes of goods and", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 13, "page": 8}}
{"chunk_id": "Handout #5 Essentials of Design- and Patent-Law_014", "text": "there too. − Generally, only the commercial exploitation of an invention or creation is protected. − The scope of protection is precisely defined. There are clear regulations that define the scope of protection for every IP right. For example, a trademark is not protected in general but only for those classes of goods and services for which it has been registered. − Free databases are available on the internet in which you can carry out basic searches on IP rights. These include: www.swissreg.ch – contains registered IP rights in Switzerland − www.wipo.int/madrid/monitor – allows for the search of international trademarks that are protected in Switzerland − https://worldwide.espacenet.com – contains more than 90 million patent documents worldwide Beware! These databases are not professional search tools. Therefore, searches in free databases cannot substitute a professional search. March 17, 2025 Page 29 Sources https://www.ige.ch/fileadmin/user_upload/kmu/e/Pocket_Guide_Gedacht_Gemacht_Geschuetzt_en_2020_bf.pdf April 6, 2022 March 17, 2025 Page 30", "metadata": {"source": "Handout #5 Essentials of Design- and Patent-Law", "chunk_index": 14, "page": 8}}
