{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_000", "text": "Privacy & Law: Fundamentals of copyright law Business March 6, 2025 March 6th, 2025 Intellectual property rights Intangible assets - Intellectual property (IP); not tangible, i.e. immaterial − Copyrights (the protection of creations of works with individual character by copyrights) − Design rights (the protection of the external appearance of a product through design protection) − Patent rights (the protection of technical developments by granting patents) − Trademark rights (the protection of signs by trademark law) March 6, 2025 Sources: https://www.skyscrapercity.com/showthread.php?t=1756166&page=4028 April 1, 2022 https://shop.contena-ochsner.ch/produktkategorie/abfallbehaelter/kehrichteimer-verzinkt/ April 1, 2022 https://www.independent.co.uk/news/uk/home-news/coca-cola-logo-uk-favourite-vintage-collectable-a8484206.html April 1, 2022 Page 2 Learning objectives  You know... 1. copyright and its properties 2. the protection requirements of copyright law 3. the registration / non-registration of copyrights 4. the term of protection of copyrights March 6, 2025 Page 3 Copyright Trademark Design Patent Protection requirements Registration Term … March 6, 2025 Page 4 Steve Jobs on the protection of intellectual", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 0, "page": 1}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_001", "text": "requirements of copyright law 3. the registration / non-registration of copyrights 4. the term of protection of copyrights March 6, 2025 Page 3 Copyright Trademark Design Patent Protection requirements Registration Term … March 6, 2025 Page 4 Steve Jobs on the protection of intellectual property: I knew from day one that Apple would go well if we created intellectual property. […]. There would have been no incentive for us to develop new software and products if they had not been protected. Once the intellectual property is no longer protection of guaranteed, creative enterprises disappear or are not even set up. Walter Isaacson, Steve Jobs, New York 2011 March 6, 2025 Source: https://www.theverge.com/2011/10/27/2517152/book-review-steve-jobs-by-walter-isaacson April 1, 2022 Page 5 Intellectual property rights – Functions? − IP rights grant their owners the legal means to exclude other people – usually competitors – from commercially using the products that carry the right. − IP rights turn innovations and creations into a marketable commodity and a company asset. − IP is an important source of information for companies, researchers, developers and creative minds. − An IP right helps the professional marketing of a product or service and promotes its reputation. March 6, 2025 Page 6 Copyright: Protection requirements for a «work» Works are literary and artistic intellectual creations with an individual", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 1, "page": 1}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_002", "text": "source of information for companies, researchers, developers and creative minds. − An IP right helps the professional marketing of a product or service and promotes its reputation. March 6, 2025 Page 6 Copyright: Protection requirements for a «work» Works are literary and artistic intellectual creations with an individual character, irrespective of their value or purpose. creation intellectual literature art work irrespective of value or purpose individuality («statistical uniqueness») March 6, 2025 Page 8 Individuality The object must have characteristics that sufficiently distinguishs it from others. This prerequisite is fulfilled if an object in the same form • • has not yet existed and is unlikely to be created again in the same way (“statistical uniqueness”). March 6, 2025 Page 9 Copyright: Protection requirements for a «work» Works are literary and artistic intellectual creations with an individual character, irrespective of their value or purpose. creation intellectual literature work art individuality irrespective of value or purpose March 6, 2025 It is not the idea that is protected, but its perceptible expression. Page 10 Copyright: Conditions of protection - Works as intellectual creations of literature and art 1. Literary, scientific and other linguistic works E.g. books, speeches, letters, original slogans are protected. Simple advertising texts, catalogues, price lists are not protected. 2. Works of music and fine arts E.g. songs 3. Works with scientific or technical content E.g. drawings,", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 2, "page": 2}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_003", "text": "scientific and other linguistic works E.g. books, speeches, letters, original slogans are protected. Simple advertising texts, catalogues, price lists are not protected. 2. Works of music and fine arts E.g. songs 3. Works with scientific or technical content E.g. drawings, plans, maps, instructions for use 4. computer programs 5. Works of architecture 6. Photographic, cinematographic or other visual works E.g. Photographs, films, television games, television programmes Special case: Derivative/Second-hand works Creations with an individual character which are created using existing works in such a way that the works used remain recognisable in their individual character E.g. Translation of a book or its film adaptation March 6, 2025 Page 11 Example 1: Copyrights to photographs - requirements Individuality - by photo-technical means in the reproduction of the photographed object - Choice of viewing angle - Selection of the image section - Selecting the focal length of the lens - Choice of aperture - Choice of brightness or coloring - by processing the photographed object - Posture of a portrayed person - Selection and spatial arrangement of a still life - Illumination or choice of the environment of the object - by tension in the picture Individuality − Characteristics distinguish the object sufficiently from others. − The object does not yet exist in the same form. − Statistical uniqueness March 6, 2025 Page 12 Copyright protection due to tension in the picture (BGE", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 3, "page": 2}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_004", "text": "choice of the environment of the object - by tension in the picture Individuality − Characteristics distinguish the object sufficiently from others. − The object does not yet exist in the same form. − Statistical uniqueness March 6, 2025 Page 12 Copyright protection due to tension in the picture (BGE 130 III 168) Example 2: Copyrights to photographs - requirements Individuality − Characteristics that distinguish the object sufficiently from others. − The object does not yet exist in the same form. − Statistical uniqueness − Federal Court: The photography is designed in such a way that it does not stand out from the usual. It therefore lacks the individual character in the sense of article 2 of the Copyright Act. March 6, 2025 No copyright protection (BGE 130 III 714) Page 13 Copyright: Authorship - co-authorship The author is the natural person who created the work. The copyright belongs exclusively to the creator of a work. He acquires this right originally, automatically, without any registration (so-called «creator principle»). Co-authorship − This occurs when several people create a work together, i.e. in conscious cooperation and according to a common concept. − In the case of co-authorship, the co-authors have the joint right to the entire hand (consent of all co-authors required!). − The financial means used to create a work are not relevant. March 6, 2025 Page 14 Copyright: Dependent", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 4, "page": 3}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_005", "text": "concept. − In the case of co-authorship, the co-authors have the joint right to the entire hand (consent of all co-authors required!). − The financial means used to create a work are not relevant. March 6, 2025 Page 14 Copyright: Dependent creation of works − Even if a work is created within the framework of a relationship of dependence, the creator originally acquires the copyright. − Employers should ensure that all copyrights are assigned in the employment contract. − The Copyright Act only has a corresponding standard for computer programs. However, this also applies only to the employment contract and not to contractual relationships based on orders and contracts for work and services. March 6, 2025 Page 15 Content of the copyright: Moral rights (Articles 9, 11 and 15 Copyright Act) 1. The author has the exclusive right to his own work and the right to recognition of his authorship. 2. The author has the exclusive right to decide whether, when, how and under what author's designation his own work is published for the first time. A work is considered to be published when it has been made available for the first time by the author, or with his consent, to a large number of persons not constituting a private circle. 3. The author has the exclusive right to decide: − whether, when and how the work may be altered; − whether, when and how the work may be used to", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 5, "page": 3}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_006", "text": "first time by the author, or with his consent, to a large number of persons not constituting a private circle. 3. The author has the exclusive right to decide: − whether, when and how the work may be altered; − whether, when and how the work may be used to create a derivative work or may be included in a collected work. 4. It is permissible to use existing works for the creation of parodies or other comparable variations on the work. March 6, 2025 Page 16 Content of the copyright: Economic rights («rights of use») / exploitation rights (Article 10 Copyright Act) 1. The author has the exclusive right to decide whether, when and how his work is used. 2. The author has the right, in particular: a. to produce copies of the work, such as printed matter or data carriers; b. to offer, transfer or otherwise distribute copies of the work; c. to recite, perform or present a work, or make it perceptible somewhere else or make it available directly or through any kind of medium in such a way that persons may access it from a place and at a time individually chosen by them; d. to broadcast the work by radio, television or similar means, including by wire. 3. The author of a computer program also has the exclusive rental right. March 6, 2025 Page 17 Copyright: Conditions and duration of protection − Automatic protection", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 6, "page": 4}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_007", "text": "time individually chosen by them; d. to broadcast the work by radio, television or similar means, including by wire. 3. The author of a computer program also has the exclusive rental right. March 6, 2025 Page 17 Copyright: Conditions and duration of protection − Automatic protection without any action on the part of the originator The copyright protection begins without any registration at the moment when a work fulfils the protection requirements, i.e. as soon as the limit of individuality is exceeded. − Term of protection 70 years after the death of the author (50 years for computer programs and photographs) March 6, 2025 Page 18 March 6, 2025 Page 19 Creative Commons March 6, 2025 Source: https://s3.amazonaws.com/libapps/accounts/25975/images/CC_Licenses.png 22.2.2023 Page 20 Limitations of copyright (selection) Private use Quotes Education Limitations of copyright Archive and backup copies Use within a business entity Temporary Reproduction Whoever publishes, reproduces, performs, broadcasts or otherwise disseminates a work requires the author’s consent. However, the Swiss Copyright Act includes the above exceptions and limitations in favor of users and consumers. March 6, 2025 Page 21 Transfer of copyright Moral rights vest in the author and cannot be transferred / licensed. However, they may, be waived or transferred to heirs upon death. Economic rights (“rights of", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 7, "page": 4}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_008", "text": "Copyright Act includes the above exceptions and limitations in favor of users and consumers. March 6, 2025 Page 21 Transfer of copyright Moral rights vest in the author and cannot be transferred / licensed. However, they may, be waived or transferred to heirs upon death. Economic rights (“rights of use”) (even parts thereof) may be transferred to third parties and transferred to heirs upon death, “rights of use” may be licensed. The transfer of a work (copy of the work) does not transfer the rights in the work, even if the original work is transferred. March 6, 2025 Page 22 Copyright law and internet: Use of content To create a website, many concepts, corporate profiles, etc. can be found in the internet: text, images, music and the like. Downloading, copying, scanning etc. are types of use of a copyrighted work. The author / right holder has the right to give permission to any kind of use of his work or to revoke this permission. This permission must be given expressly (verbally or in writing) or implied. However, do not assume that if the author / right holder remains silent to your use he / she permits such use. In practice, this means that works which are available in the internet, may not be used without explicit permission by the right holder. When published works are used as sources in the internet, they must be cited in the way books are cited; otherwise, plagiarism is taking", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 8, "page": 5}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_009", "text": "he / she permits such use. In practice, this means that works which are available in the internet, may not be used without explicit permission by the right holder. When published works are used as sources in the internet, they must be cited in the way books are cited; otherwise, plagiarism is taking place. March 6, 2025 Page 23 Copyright law and internet: Links − Inserting links means the linking of different internet pages with one another. − This first of all facilitates access to the linked page (by clicking directly on the link), and secondly implies to the internet user that the linked pages are associated. This assumption can be wrong. − Therefore, rights can in fact be infringed simply through linking, such as those contained in the Federal Act against Unfair Competition (UCA) or the Data Protection Act (DPA). − Therefore, linking should always be agreed upon between the parties. March 6, 2025 Page 24 Copyright law and the internet: how to protect your online content? − Place copyright notice on your content (metatags) − Notice first use (e.g. date of photo) − Only use resized photos / logos − Search for copies − Research web.archive.org − Send warnings and reminders to unlawful users (cease and desist letter) − Request deletion / blocking by internet provider − Request deleting from search engines March 6, 2025 Page 25 Case 1: “Sunny Beachclub Ltd” The", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 9, "page": 6}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_010", "text": "Search for copies − Research web.archive.org − Send warnings and reminders to unlawful users (cease and desist letter) − Request deletion / blocking by internet provider − Request deleting from search engines March 6, 2025 Page 25 Case 1: “Sunny Beachclub Ltd” The “Sunny Beachclub Ltd” would like to have a new homepage created for them, combined with a webshop for the sale of sunglasses, sun creams, bath towels, etc. Therefore, it hires the “Trabax Design Ltd”, a company specialized in the creation of websites. Is the software protected by copyright? March 6, 2025 Page 26 Case 1: “Sunny Beachclub Ltd” Copyright: Protection requirements for a «work» Works are literary and artistic intellectual creations with an individual character, irrespective of their value or purpose. creation intellectual literature art work irrespective of value or purpose individuality («statistical uniqueness») March 6, 2025 Page 28 Case 1: “Sunny Beachclub Ltd” The “Sunny Beachclub Ltd” would like to have a new homepage created for them, combined with a webshop for the sale of sunglasses, sun creams, bath towels, etc. Therefore, it hires the “Trabax Design Ltd”, a company specialized in the creation of tailor-made websites. Is the software protected by copyright? Who owns the copyrights to the created software and to the graphic elements etc.? March", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 10, "page": 6}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_011", "text": "for the sale of sunglasses, sun creams, bath towels, etc. Therefore, it hires the “Trabax Design Ltd”, a company specialized in the creation of tailor-made websites. Is the software protected by copyright? Who owns the copyrights to the created software and to the graphic elements etc.? March 6, 2025 Page 29 Case 1: “Sunny Beachclub Ltd” Software development agreement Sunny Beach Club Ltd. Trabax Design Ltd. Employment agreement March 6, 2025 Page 30 Case 2: “Soft Ltd” (Part 1) The “Simsalabim Ltd”, a large carpentry workshop in Eastern Switzerland specializes in the production of doors. The “Simsalabim Ltd” wants to introduce a new merchandise management system. For this reason, it contacts the “Soft Ltd”, which distributes a merchandise management system as a partner of “Development Ltd” and carries out customer-specific adaptations, training courses, installations, etc. In the course of implementation, the “Simsalabim Ltd” will make customer-specific adjustments. Who owns the copyright to these customizations? March 6, 2025 Page 31 Case 2: “Soft Ltd” (Part 1) Simsalabim Ltd. Software development Agreement (customization) Soft Ltd. Development Ltd. Merchandise Management Software (Standard software) March 6, 2025 Page 32 Case 2: “Soft Ltd” (Part", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 11, "page": 6}}
{"chunk_id": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law_012", "text": "Case 2: “Soft Ltd” (Part 1) Simsalabim Ltd. Software development Agreement (customization) Soft Ltd. Development Ltd. Merchandise Management Software (Standard software) March 6, 2025 Page 32 Case 2: “Soft Ltd” (Part 2) The “Soft Ltd\" has massive liquidity problems, which is why it has been in arrears with wage payments for some time now. For this reason, many of the urgently needed maintenance work for \"Simsalabim Ltd\" will no longer be carried out or will be carried out only after a considerable delay. How can it be achieved that “Simsalabim Ltd” can still continue to work with the software if maintenance work is not carried out by the “Soft Ltd”? March 6, 2025 Page 33 Case 2: “Soft Ltd” (Part 2) Escrow Agent Source Code Source Code Escrow Agreement Simsalabim Ltd. Soft Ltd. March 6, 2025 Page 34 Sources https://www.ige.ch/fileadmin/user_upload/kmu/d/Pocket_Guide_Gedacht_Gemacht_Geschuetzt_de_2023_bf_.pdf February 6, 2024 March 6, 2025 Page 35", "metadata": {"source": "Handout #3 Introduction to Intellectual Property Law and Essentials of Copyright Law", "chunk_index": 12, "page": 7}}
