{"chunk_id": "Handout #4 Essentials of Trademark Law_000", "text": "Privacy & Law Essentials of trademark law Business March 10, 2025 March 13h, 2025 Learning objectives You... − are familiar with the main features of the regulations of the Trade Mark Protection Act − know the protection requirements for trademarks − are able to distinguish between the different trademark forms and trademark types − are aware of the registration and term of protection of trademarks March 10, 2025 Page 2 Copyright Trademark Design Patent Protection requirements Registration Term … March 10, 2025 Page 3 Trademark law: Legal basis (Article 1 Trademark Protection Act) − The legal basis for the protection of trademarks is the Trademark Protection Act. − A trademark is a sign capable of distinguishing the goods or services of one company from those of another company. − Trademarks are a key awareness-raising feature for goods or services. A lot of time and money are often invested in their creation and maintenance so they therefore represent valuable capital. You stand out from your competitors with a trademark! − Trademark protection grants the owner the exclusive right to use his trademark for identifying goods and services. This right can be passed on through licensing or sale, for example. March 10, 2025 Page 4 Trademark law: Legal basis (Article 1 Trademark Protection Act) In particular, trademarks may consist of − words − letters − numerals − figurative representations (graphic images) − three-dimensional shapes − slogans or − combinations of such elements with one another", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 0, "page": 1}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_001", "text": "2025 Page 4 Trademark law: Legal basis (Article 1 Trademark Protection Act) In particular, trademarks may consist of − words − letters − numerals − figurative representations (graphic images) − three-dimensional shapes − slogans or − combinations of such elements with one another or with colours. Registration for classes and goods needed! March 10, 2025 Page 5 Trademark law: Trademark types Differentiation according to form − Word mark; e.g. PUMA − Figurative mark; e.g. − Combined word/figurative mark; e.g. − Shape mark; e.g. Differentiation according to purpose − Individual mark: A trademark of an individual company for a specific good or service. − Guarantee mark: Guarantee of certain product characteristics e.g. ipsuisse − Collective mark: Identification of the products of an association e.g. Fleurop March 10, 2025 Page 6 Trademark law: Protection requirements - examples for absolute grounds for exclusion Trademarks are only valid if they are registered. In Switzerland, trademarks need to be registered with the Swiss Federal Institute of Intellectual Property (IPI). (www.ige.ch) If one of the following grounds exist, the trade mark will not be registered by the IPI: 1. Signs that are in the public domain. They must remain available to everyone and cannot be registered. − “Generic names”: Trademarks which merely describe a product or designate an object as", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 1, "page": 1}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_002", "text": "If one of the following grounds exist, the trade mark will not be registered by the IPI: 1. Signs that are in the public domain. They must remain available to everyone and cannot be registered. − “Generic names”: Trademarks which merely describe a product or designate an object as such E.g. “Apple” for apples − “Free characters” (Freizeichen): “Degenerated\" designations or competitors are dependent on the use of these symbols E.g: 4k or plexiglass March 10, 2025 Page 7 Trademark law: Protection requirements - examples for absolute grounds for exclusion 2. Shapes that constitute the nature of the goods themselves or shapes of the goods or their packaging that are technically necessary. 3. Misleading signs: False expectations regarding origin, quality or business circumstances“ e.g.«GoldArt» 4. Signs contrary to public policy, morality or applicable law 5. Coats of arms and other public signs March 10, 2025 Page 8 Trademark law: protection requirements - relative grounds for exclusion − The trademark is not registered on request of a third party (opposition) if identical or similar signs with the same or similar products exist. − No guarantee from the IPI! − Filing of an opposition to a new trademark within three months following the publication.  Danger of confusion! March 10, 2025 Page 9 Trademark law: Case", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 2, "page": 2}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_003", "text": "if identical or similar signs with the same or similar products exist. − No guarantee from the IPI! − Filing of an opposition to a new trademark within three months following the publication.  Danger of confusion! March 10, 2025 Page 9 Trademark law: Case \"Rivella - Apiella\" CH brand P-412855 Etiquette Denner March 10, 2025 Page 10 Trademark law: Danger/Likelihood of confusion − Types of confusion (checklist for examination! alternative) − Optics: Word length and type of letters − Acoustics: Syllable number, pronunciation cadence, vowel order E.g. \"Tobler-o-rum\" / \"Torero-Rum\" − Sense content: Mediation of «substitute for» or «as good as» − Characteristic strength: Strong brands have a greater scope of protection − Addressees: View of the person taking the purchase decision − Memory of the addressees: The likelihood of confusion is greater with mass articles than with special products / attention in the jewellery business is higher than in the department store − The overall impression of the average customer is decisive. March 10, 2025 Page 11 Trademark law: Danger/Likelihood of confusion Case \"Rivella - Apiella\" − \"\"Apiella\" is too similar to the word mark as well as the visual appearance of Rivella, which leads to an indirect", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 3, "page": 2}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_004", "text": "customer is decisive. March 10, 2025 Page 11 Trademark law: Danger/Likelihood of confusion Case \"Rivella - Apiella\" − \"\"Apiella\" is too similar to the word mark as well as the visual appearance of Rivella, which leads to an indirect likelihood of confusion. Due to the fact that both companies market the same product (soft drinks), a particularly strict standard should be applied.” − “It should also be taken into account that Rivella has established itself as a strong brand and is therefore particularly exposed to attempts to freeride. The protected similarity range is therefore larger” (BGE 126 III 315) March 10, 2025 Page 12 Trademark law: Protection requirements − In principal, it is possible to register the same trademark for completely different products. − The more similar the products are, the more the brands must differ from each other, because the danger of confusion is greater with similar products. Conversely, for similar brands, a correspondingly large distance is required between the products. March 10, 2025 Page 13 Trademark law: Registration − Trademark protection is territorial: Protection in the country in which the trademark is registered only. − Registration for Switzerland: IPI (www.ige.ch) − Registrierung international: IPI  World Intellectual Property Organziation (www.wipo.int) − Registration principle: The trademark is not created until it is entered in the", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 4, "page": 3}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_005", "text": "in which the trademark is registered only. − Registration for Switzerland: IPI (www.ige.ch) − Registrierung international: IPI  World Intellectual Property Organziation (www.wipo.int) − Registration principle: The trademark is not created until it is entered in the register. One exception is the well-known trademark (e.g.: \"Galeries Lafayette\" vs. \"Lafayette Chocolatier en Suisse\"). − Speciality principle: A trademark must be assigned to one or more goods or services and is subsequently protected only for this use. An exception is the famous trademark. − Fees: www.ige.ch March 10, 2025 Page 14 Trademark law: Registration Publication − www.swissreg.ch − Beginning of three-month opposition period: owners of prior trademarks that are identical or similar to the filed trademark can file opposition to the newly filed trademark during this period. Term of protection − 10 years from date of deposit / can be renewed by a further 10 years in each case − Filing priority: In principle, the trademark right belongs to the party who first filed the trademark application. − Priority arises with the application. − Contracting State to the Paris Convention / official exhibition or fair: 6 months priority extension March 10, 2025 Page 15 Trademark law: Registration Do you want to register your trademark? You can apply to register a trademark online at", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 5, "page": 3}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_006", "text": "application. − Priority arises with the application. − Contracting State to the Paris Convention / official exhibition or fair: 6 months priority extension March 10, 2025 Page 15 Trademark law: Registration Do you want to register your trademark? You can apply to register a trademark online at https://www.ige.ch/en/protecting-your-ip/trade-marks/national- applications The application consists of an index of goods and services for which you want to use the trademark as well as an image of the trademark. Following its registration, the trademark is then published on www.swissreg.ch. March 10, 2025 Page 16 Trademark law: Use of trademark Do I need to use my trademark? Do I need to use the ® sign in Switzerland? March 10, 2025 Page 17 Sources https://www.ige.ch/fileadmin/user_upload/kmu/e/Pocket_Guide_Gedacht_Gemacht_Geschuetzt_en_2020_bf.pdf April 6, 2022 March 10, 2025 Page 18 Case: «PUMA vs. FIFA» Puma had registered the word marks \"PUMA WORLD CUP QATAR 2022\" and \"PUMA WORLD CUP 2022\" in the Swiss trademark register for, among other things, sporting goods, clothing and accessories. Since Puma is not one of the sponsors of the World Cup, FIFA, as the organizer", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 6, "page": 4}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_007", "text": "WORLD CUP QATAR 2022\" and \"PUMA WORLD CUP 2022\" in the Swiss trademark register for, among other things, sporting goods, clothing and accessories. Since Puma is not one of the sponsors of the World Cup, FIFA, as the organizer of the event, took issue with this and filed an action with the Zurich Commercial Court to have Puma's trademarks declared null and void. What would be your verdict as a judge? March 10, 2025 Page 19 Trademark law: Protection requirements - examples for absolute grounds for exclusion Trademarks are only valid if they are registered. In Switzerland, trademarks need to be registered with the Swiss Federal Institute of Intellectual Property (IPI). (www.ige.ch) If one of the following grounds exist, the trademark will not be registered by the IPI. 1. Signs that are in the public domain. They must remain available to everyone and cannot be registered. − “Generic names”: Trademarks which merely describe a product or designate an object as such E.g. “Apple” for apples − “Free characters” (Freizeichen): “Degenerated\" designations or competitors are dependent on the use of these symbols E.g: hair dryer, linoleum, nylon or plexiglass March 10, 2025 Page 20 Trademark law: Protection requirements - examples for absolute grounds for exclusion 2. Shapes that constitute the nature of the goods themselves or shapes", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 7, "page": 4}}
{"chunk_id": "Handout #4 Essentials of Trademark Law_008", "text": "dependent on the use of these symbols E.g: hair dryer, linoleum, nylon or plexiglass March 10, 2025 Page 20 Trademark law: Protection requirements - examples for absolute grounds for exclusion 2. Shapes that constitute the nature of the goods themselves or shapes of the goods or their packaging that are technically necessary. 3. Misleading signs: False expectations regarding origin, quality or business circumstances“ e.g.«GoldArt» 4. Signs contrary to public policy, morality or applicable law 5. Coats of arms and other public signs March 10, 2025 Page 21", "metadata": {"source": "Handout #4 Essentials of Trademark Law", "chunk_index": 8, "page": 5}}
