{"chunk_id": "Module-Description_000", "text": "Module Description, available in: EN, FR Privacy and Law General Information Number of ECTS Credits 3 Module code CM_PrivLaw Valid for academic year 2024-25 Last modification 2022-01-10 Coordinator of the module Marc Fischer (HSLU, marc.fischer@hslu.ch) Explanations regarding the language definitions for each location: Instruction is given in the language defined below for each location/each time the module is held. Documentation is available in the languages defined below. Where documents are in several languages, the percentage distribution is shown (100% = all the documentation). The examination is available 100% in the languages shown for each location/each time it is held. Lausanne Lugano Zurich X F 100% X F 100% X F 100% X E 100% X E 100% X E 100% Instruction Documentation Examination Module Category CM Context module Lessons 2 lecture periods and 1 tutorial period per week Entry level competences Prerequisites, previous knowledge None Brief course description of module objectives and content In the Privacy and Law module, students gain an awareness of the threats to privacy in the fast changing digital society and are prompted to reflect on values in the historical and intercultural context. Students acquire an overview (system and reference knowledge) of actual legal aspects that have not been specifically covered in either the vocational baccalaureate or in the Bachelor's degree course. In the knowledge and information society", "metadata": {"source": "Module-Description", "chunk_index": 0, "page": 1}}
{"chunk_id": "Module-Description_001", "text": "society and are prompted to reflect on values in the historical and intercultural context. Students acquire an overview (system and reference knowledge) of actual legal aspects that have not been specifically covered in either the vocational baccalaureate or in the Bachelor's degree course. In the knowledge and information society these are, in particular, the legal aspects privat data protection, copyright, brand rights, patents, forms of collaboration in the digital economy, relevant contractsetc. CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 1 Aims, content, methods Learning objectives and acquired competencies Understanding the different dimensions of privacy. Thinking in the corresponding contexts. Transferring privacy aspects to and within the private and work environment and reflecting upon these, establishing links with learning content in the MRU and the technical modules. Acquiring an appreciation of the legal aspects confronting an engineer in demanding professional situations. Gaining awareness in order to avoid damages due to infringements of rights or legal uncertainty. Acquisition of speaking and listening skills in order to conduct the corresponding specialist discussions with experts. Contents of module with emphasis on teaching content Introduction to law and the privacy aspects of law Knowledge of the industry relevant contracts (word & labour, licence, NDA, SLA etc.) Ventures in digital environment (forms, GeBüV, Compliance etc.) Knowledge of the creation and development of privacy as a fundamental/human right (GDPR included) Knowledge of IP-law", "metadata": {"source": "Module-Description", "chunk_index": 1, "page": 1}}
{"chunk_id": "Module-Description_002", "text": "of law Knowledge of the industry relevant contracts (word & labour, licence, NDA, SLA etc.) Ventures in digital environment (forms, GeBüV, Compliance etc.) Knowledge of the creation and development of privacy as a fundamental/human right (GDPR included) Knowledge of IP-law (copyrights, trade marks, design, patents, unfair competition) Knowledge of legal aspects of new technologies as AI, Blockchain etc. Formative tests Teaching and learning methods Frontal instruction in the lectures (2 lessons per week) Seminar-type teaching in the tutorials (1 lesson per week) Literature Lecture handouts provided by the lecturer and the references to current literature they contain Assessment Certification requirements Module uses certification requirements Certification requirements for final examinations (conditions for attestation) 80% attendance Basic principle for exams As a rule, all the standard final exams for modules and also all resit exams are to be in written form Standard final exam for a module and written resit exam Kind of exam written Duration of exam 120 minutes Permissible aids Aids permitted as specified below: Permissible electronic aids Laptop Other permissible aids Open Book Special case: Resit exam as oral exam Kind of exam oral Duration of exam 30 minutes Permissible aids CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 2 Aids permitted as specified below: Permissible electronic aids No electronic aids permitted Other permissible aids Open Book CM_PrivLaw-2024-25.pdf /", "metadata": {"source": "Module-Description", "chunk_index": 2, "page": 2}}
{"chunk_id": "Module-Description_003", "text": "of exam 30 minutes Permissible aids CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 2 Aids permitted as specified below: Permissible electronic aids No electronic aids permitted Other permissible aids Open Book CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 3 Description du module, disponible en: EN, FR La sphère privée et le droit Informations générales Nombre de crédits ECTS 3 Code du module CM_PrivLaw Valable pour l'année académique 2024-25 Dernière modification 2022-01-10 Coordinateur/coordinatrice du module Marc Fischer (HSLU, marc.fischer@hslu.ch) Explication des définitions de langue par lieu : Les cours se dérouleront dans la langue définie ci-dessous par lieu/exécution. Les documents sont disponibles dans les langues définies ci-dessous. Pour le multilinguisme, voir la répartition en pourcentage (100% = documents complets) L'examen est disponible à 100% dans chaque langue sélectionnée pour chaque lieu/exécution. Lausanne Lugano Zurich Leçons Documentation Examen X F 100% X F 100% X F 100% X E 100% X E 100% X E 100% Catégorie de module CM modules contextuels", "metadata": {"source": "Module-Description", "chunk_index": 3, "page": 2}}
{"chunk_id": "Module-Description_004", "text": "sélectionnée pour chaque lieu/exécution. Lausanne Lugano Zurich Leçons Documentation Examen X F 100% X F 100% X F 100% X E 100% X E 100% X E 100% Catégorie de module CM modules contextuels Leçons 2 leçons et 1 leçon de pratique par semaine Compétences préalables Connaissances préalables, compétences initiales Aucune Brève description du contenu et des objectifs Le module «Privacy and Law» sensibilise les étudiants aux menaces pesant sur la vie privée dans la société postmoderne et incite à la réflexion sur des valeurs dans les contextes interculturel et historique. Les étudiants reçoivent une vue d’ensemble (connaissance de système et d’orientation) concernant les aspects juridiques, qui n’ont été spécialement thématisés ni dans le cadre de la maturité professionnelle ni dans les études de bachelor. Dans la société du Savoir et de l’Information, il s’agit là en particulier des aspects juridiques des biens immatériels comme les données, les droits d’auteur, brevets, les droits liés à la marque etc. CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 4 Objectifs,", "metadata": {"source": "Module-Description", "chunk_index": 4, "page": 3}}
{"chunk_id": "Module-Description_005", "text": "des aspects juridiques des biens immatériels comme les données, les droits d’auteur, brevets, les droits liés à la marque etc. CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 4 Objectifs, contenus, méthodes Objectifs d'apprentissage, compétences à acquérir Compréhension des différentes dimensions de la vie privée. Penser aux liens entre celles-ci. Transfert et réflexion des aspects de la vie privée sur et dans les environnements privé et professionnel, faire des liens avec les contenus d’apprentissage dans le Master Research Units et les modules techniques. Sensibilisation à des aspects juridiques, auxquels les ingénieurs sont confrontés dans des situations professionnelles exigeantes. Acquérir une sensibilisation pour éviter des dommages à cause d’atteinte au droit ou d’incertitudes juridiques. Acquisition d’une compétence de discussion et d’écoute, pour pouvoir conduire des entretiens spécialisés appropriés avec des experts. Contenu des modules avec pondération du contenu des cours Introduction au droit et à ses aspects de la vie privée Comprendre et réfléchir aux liens entre la protection des données, le droit d’auteur et la vie privée, et à leur interconnexion", "metadata": {"source": "Module-Description", "chunk_index": 5, "page": 3}}
{"chunk_id": "Module-Description_006", "text": "des experts. Contenu des modules avec pondération du contenu des cours Introduction au droit et à ses aspects de la vie privée Comprendre et réfléchir aux liens entre la protection des données, le droit d’auteur et la vie privée, et à leur interconnexion avec les développements technologiques, connaître les conflits d’objectifs Connaître l’apparition et le développement de la notion de «vie privée» dans les droits de l’homme / le droit fondamental Connaître les grandes lignes de la protection des données et de la personnalité Connaître les concepts du lancement d’alerte Connaître les grands principes du droit d’auteur Comprendre les possibilités et les limites des répercussions des droits en matière Connaître les grandes lignes des contrats importants dans l’industrie Connaître grandes lignes du droit des brevets Connaître les grandes lignes du droit des marques et du droit sur un design Evaluation formative Méthodes d'enseignement et d'apprentissage Cours magistral dans les cours (2 leçons par semaine) Cours en séminaire dans les exercices (1 leçon par semaine) Bibliographie Handout du cours de l’enseignant et renvoi des notes à la littérature actuelle Evaluation Conditions d'admission Le module", "metadata": {"source": "Module-Description", "chunk_index": 6, "page": 4}}
{"chunk_id": "Module-Description_007", "text": "les cours (2 leçons par semaine) Cours en séminaire dans les exercices (1 leçon par semaine) Bibliographie Handout du cours de l’enseignant et renvoi des notes à la littérature actuelle Evaluation Conditions d'admission Le module utilise les conditions d'admission Conditions d'admission à l'examen de fin de module (exigences du certificat) 80% de présence Principe pour les examens En règle générale, tous les examens de fin de module réguliers et les examens de rattrapage sont organisés sous la forme écrite Examen de fin de module régulier et examen écrit de répétition Type de l'examen écrit Durée de l'examen 120 minutes Aides autorisées Les aides suivantes sont autorisées: Aides électroniques autorisées Laptop Autres aides autorisées Open Book Cas spécial: examen de répétition oral Type de l'examen CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 5 oral Durée de l'examen 30 minutes Aides autorisées Les aides suivantes sont autorisées: Aides électroniques autorisées Aucune aide électronique autorisée Autres aides Open Book Powered by TCPDF (www.tcpdf.org)", "metadata": {"source": "Module-Description", "chunk_index": 7, "page": 4}}
{"chunk_id": "Module-Description_008", "text": "Page 5 oral Durée de l'examen 30 minutes Aides autorisées Les aides suivantes sont autorisées: Aides électroniques autorisées Aucune aide électronique autorisée Autres aides Open Book Powered by TCPDF (www.tcpdf.org) CM_PrivLaw-2024-25.pdf / 2025-02-10 Page 6", "metadata": {"source": "Module-Description", "chunk_index": 8, "page": 5}}
