{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_000", "text": "PRIVACY & LAW FS 25 Introduction Unfair Competition Law Learning goals ▸ You know the General Rule (Art. 2 UWG) ▸ You know the Special Matter (Art. 3 - 8 UWG) ▸ You know when comparisons are illegal ▸ You know bribery and accepting bribes (Art. 4a UWG) ▸ You know the legal consequences of violations of the UWG ▸ You know the task of the commission on fairness Examples Unfair poaching of an entire IT-team. General principles of the Law on Unfair Competition (UWG) ▸ „UWG” protects fair competition and thus good faith in business transactions as well as fair business practices. But there’s no „Unfair-Competition-Police”! ▸ All market players and their organisations of a speciﬁc marked are protected against unfair business practices: Competitors, customers at all levels of trade, in particular consumers, professional and trade associations, consumer organisations. ▸ The federal government (SECO) can intervene if collective interests are affected. But seldom do. ▸ Rules on clear, comparable and non-misleading prices, whether in the store window, in the store or in advertising, promote fair competition. ▸ The „UWG” therefore also contains the basic rules for the correct announcement of prices and against misleading price comparisons. Detailed rules are set out in the Ordinance on the Publication of Prices", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 0, "page": 1}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_001", "text": "prices, whether in the store window, in the store or in advertising, promote fair competition. ▸ The „UWG” therefore also contains the basic rules for the correct announcement of prices and against misleading price comparisons. Detailed rules are set out in the Ordinance on the Publication of Prices („Preisbekanntgabe-Verordnung”, PBV). Addressees of the UWG ▸ All persons whose behaviour or business conduct can have an effect on economic competition. ▸ Thus, anyone who might inﬂuence competition on a speciﬁc Swiss Marked („marked-place-principle”) can act unfairly! Also media! But more and more also: IT-companies, e-commerce and telcos. ▸ Case: init7 vs. Swisscom Inside IT, 10.02.23: „Meinung: Swisscom sollte sich erklären” (https://www.inside-it.ch/meinung-swisscom- sollte-sich-erklaeren-20230210) NB: Swisscom was April ’24 ﬁned from WEKO with 18 Mio. CHF for abusing its marked power… ▸ Actual case: homelift.ch vs. homelifte.ch (unfortunately the client decided not to proceed further in that case. He would have good chances) „Kassensturz“-contribution on pain killers becomes expensive for SRG", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 1, "page": 1}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_002", "text": "for abusing its marked power… ▸ Actual case: homelift.ch vs. homelifte.ch (unfortunately the client decided not to proceed further in that case. He would have good chances) „Kassensturz“-contribution on pain killers becomes expensive for SRG („Kontraschmerz“-case) old, but still important! Look: BGE 129 III 353 about PULS-Tipp The General Rule (Art. 2 UWG) ▸ \"Unfair and unlawful conduct or business practices which are deceptive or otherwise contrary to the principle of good faith and which affect the relationship between competitors or between suppliers and purchasers“. ▸ Very open formulated and therefore also suitable/important for new business e.g. e-commerce, telecommunication etc. ▸ But: the UWG also provides for criminal consequences. In that „ﬁeld” there’s also the „nulla poena sine lege”-rule important! Therefore it’s unlikely that somebody will be punished for violating the General Rule. ▸ But: the UWG also provides civil consequences (damage etc.). And in that „ﬁeld” the General Rule is an important regulation if the „Spezialtatbestände” (Art. 3 ff UWG) don’t ﬁt. ▸ You always have ﬁrst to check the „Spezialtatbestände” - the General Rule is only applicable if the „Special Matter of", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 2, "page": 1}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_003", "text": "Rule is an important regulation if the „Spezialtatbestände” (Art. 3 ff UWG) don’t ﬁt. ▸ You always have ﬁrst to check the „Spezialtatbestände” - the General Rule is only applicable if the „Special Matter of Fact-Rules” are not applicable! RELATION BETWEEN UWG AND COPYRIGHT, TRADEMARK OR DESIGNRIGHTS ▸ Question: could the UWG used to „prolong” an intellectual property right? ▸ Principle of freedom of imitation. It is not unfair to copy objects that are not (or no longer) protected under intellectual property law (BGE 131 III 384) ▸ S. auch BGer, 2.5.2011 – Le-Corbusier-Möbel III, sic! 2011, 504 \"Leistungen oder Arbeitsergebnisse, die als solche keinen Immaterialgüterschutz geniessen, dürfen von jedermann genutzt werden; das Lauterkeitsrecht enthält kein generelles Verbot, fremde Leistungen nachzuahmen, sondern es besteht grundsätzlich Nachahmungsfreiheit. Das UWG bezweckt die Gewährleistung der Lauterkeit des Wettbewerbs, während es dem Immaterialgüterrecht vorbehalten ist, besondere Leistungen als solche zu schützen.” ▸ But if", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 3, "page": 2}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_004", "text": "Das UWG bezweckt die Gewährleistung der Lauterkeit des Wettbewerbs, während es dem Immaterialgüterrecht vorbehalten ist, besondere Leistungen als solche zu schützen.” ▸ But if the copied objects are still protected by intellectual property then you can argument also with the UWG (example: BGE 127 III 33, Brico) Special Matter of facts („Spezialtatbestände“): Art. 3- 8 UWG (1. part) ▸ Degrade & imitation of the competitor (degrading, comparison, imitation, lean on) ▸ Misleading (probably also a direct criminal act: slander, defamation!) ▸ Inﬂuencing the will of a third party to conclude a contract ▸ Seduce for breach of contract ▸ Utilisation of external work results ▸ Violation of manufacturing and trade secrets ▸ Use of abusive terms and conditions („AGB“ / „terms & trades“) Special Matter of Facts („Spezialtatbestände“): Art. 3- 8 UWG (2. part) ▸ Ban to SPAM! (Art. 3 para. 1 lit. o UWG) ▸ Formal requirements for (paid) entries in registers (Art. 3 para. 1 lit. p UWG) ▸ Prohibition of snowball, avalanche or pyramid systems", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 4, "page": 2}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_005", "text": "▸ Ban to SPAM! (Art. 3 para. 1 lit. o UWG) ▸ Formal requirements for (paid) entries in registers (Art. 3 para. 1 lit. p UWG) ▸ Prohibition of snowball, avalanche or pyramid systems (Art. 3 para. 1 lit. r UWG) ▸ Imprint („Impressum“) obligation in electrical business transactions! (Art. 3 para. 1 lit. s UWG) ▸ Ban on overpriced value-added service numbers in competitions (Art. 3 Par. 1 lit. t UWG) ▸ Prohibition of disclosure of addresses (Art. 3 para. 1 lit. u UWG) ▸ Prohibition of „Geoblocking” (Art. 3a UWG) In Detail… 🤩 Art. 3 Unfair advertising and sales methods and other unlawful conduct 1 A person acts unfairly if they: a. disparage others, their goods, work, services, prices or their business relationships by making incorrect, misleading or unnecessarily harmful statements; b. provide incorrect or misleading information about themselves, their business, their business name, their goods, works or services, their prices, their volume in stock, the nature of the sales transaction or about their business relationships or beneﬁt third parties in competition through such conduct; c. use incorrect titles or professional designations that", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 5, "page": 3}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_006", "text": "information about themselves, their business, their business name, their goods, works or services, their prices, their volume in stock, the nature of the sales transaction or about their business relationships or beneﬁt third parties in competition through such conduct; c. use incorrect titles or professional designations that are likely to give the impression that they hold special qualiﬁcations or skills; d. take measures that are likely to cause confusion with the goods, works, services or the business operations of others; e. compare themselves, their goods, works, services or their prices in an incorrect, misleading, unnecessarily disparaging or plagiaristic way with others, their goods, works, services or prices or beneﬁt third parties in competition through such conduct; f. repeatedly offer selected goods, works or services at below the cost price, give special emphasis to these offers in advertising and thus deceive the customer as to their own or their competitors’ performance; deception is presumed if the sale price is less than the cost price of comparable purchases of similar goods, works or services; if the defendant proves the actual cost price, this price is decisive in the assessment; g. deceive the customer as to the actual value of the offer by adding premiums; h. adversely affect the customer’s freedom to decide by using particularly aggressive sales methods; i. conceal the condition, quantity, purpose, use or dangerousness of goods, works or services and thereby deceive the customer; k. fail to state their business", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 6, "page": 3}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_007", "text": "the actual value of the offer by adding premiums; h. adversely affect the customer’s freedom to decide by using particularly aggressive sales methods; i. conceal the condition, quantity, purpose, use or dangerousness of goods, works or services and thereby deceive the customer; k. fail to state their business name clearly in public statements about consumer credit or fail to indicate clearly the net amount of the credit or the overall costs of the credit and the effective annual interest rate; l. fail to state their business name clearly in public statements about consumer credit to pay for goods or services or fail to indicate clearly the cash price, the price to be paid under the credit agreement, and the effective annual interest rate; m. offer or conclude a consumer credit agreement in the course of a business activity and in doing so use contract forms that contain incomplete or incorrect information about the subject matter of the contract, the price, the payment terms, the duration of the contract, the customer’s right to withdraw from or terminate the contract or the customer's right to make early repayment of the outstanding debt; n. fail to state in public statements about consumer credit (let. k) or consumer credit to pay for goods or services (let. l) that the granting of credit is prohibited if it leads to the consumer’s overindebtedness; o. send or arrange to be sent mass advertising without direct connection with any requested content by telecommunication and in doing so fail to obtain the prior consent of the customer, or", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 7, "page": 4}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_008", "text": "(let. l) that the granting of credit is prohibited if it leads to the consumer’s overindebtedness; o. send or arrange to be sent mass advertising without direct connection with any requested content by telecommunication and in doing so fail to obtain the prior consent of the customer, or to indicate the correct sender or a simple and free of charge option of refusal; any person who receives contact details of a customer when selling goods, works or services, and who indicates the option of refusal when doing so, does not act unfairly if they send that same customer mass advertising for their own similar goods, works or services without the customer's consent; p. solicit entries in directories of any nature using offer forms, correction proposals or similar or solicit advertising orders or offer such entries or advertising orders directly without indicating the following in large print, in a prominent place and in understandable language: 1. that the offer is private in character and subject to a charge, 2. the duration of the contract, 3. the total price for that duration, and 4. the geographical spread, form, minimum print run and the latest date of publication; q. send invoices for entries in directories of any nature or for advertising orders, without being given a corresponding order beforehand; r. promise to supply goods, pay bonuses or provide other services on conditions that are advantageous to the recipient primarily if the recipient recruits other persons and less if the recipient sells or makes use of the goods or services", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 8, "page": 4}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_009", "text": "in directories of any nature or for advertising orders, without being given a corresponding order beforehand; r. promise to supply goods, pay bonuses or provide other services on conditions that are advantageous to the recipient primarily if the recipient recruits other persons and less if the recipient sells or makes use of the goods or services (snowball, avalanche or pyramid schemes); s. offer goods, works or services online and in doing so fail: 1. to provide clear and complete details of their identity and their contact address including their email address, 2. to indicate the individual technical steps that lead to a contract being concluded, 3. to provide suitable technical means for identifying and correcting input errors before submitting the order, 4. to provide immediate online conﬁrmation of the customer's order; t. promise a prize as part of a competition or a prize draw the redemption of which is conditional on the use of a chargeable value-added service number, the payment of compensation for expenses, the purchase of a good or service or participation in a sales event, promotional trip or a further prize draw u. fail to observe a note in the telephone directory that a customer does not wish to receive advertising from persons with whom they have no business relationship and that their data may not be passed on for the purposes of direct advertising; customers without a directory entry shall be treated in the same way as customers with a directory entry and note; v.make advertising calls without displaying a telephone number which is entered in the telephone", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 9, "page": 5}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_010", "text": "persons with whom they have no business relationship and that their data may not be passed on for the purposes of direct advertising; customers without a directory entry shall be treated in the same way as customers with a directory entry and note; v.make advertising calls without displaying a telephone number which is entered in the telephone directory and which they are entitled to use; w.make use of information that has come to their knowledge as a result of an infringement of letter u or v. Paragraph 1 letter s does not apply to voice telephony and to contracts concluded exclusively by the exchange of electronic mail or by comparable individual communication. Since March 2021: Art. 3a UWG - Discrimination in long-distance trading („Geoblocking”) 1 A person acts unfairly towards a customer in Switzerland in particular if, in long-distance trading, without objective justiﬁcation, on the basis of the customer’s nationality, place of residence, place of establishment, the registered ofﬁce of the customer’s payment service provider or the place of issue of the customer’s means of payment: a. they discriminate in relation to the price or terms of payment; b. they block or restrict the customer’s access to an online portal; or c. they redirect the customer to a version of the online portal other than the one originally visited without the customer’s consent. 2 This provision does not apply to non-economic services of general interest; ﬁnancial services; electronic communication services; public transport", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 10, "page": 6}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_011", "text": "access to an online portal; or c. they redirect the customer to a version of the online portal other than the one originally visited without the customer’s consent. 2 This provision does not apply to non-economic services of general interest; ﬁnancial services; electronic communication services; public transport services; services provided by temporary employment agencies; healthcare services; games of chance that require a monetary stake, including lotteries, games of chance in casinos and betting; private security services; social services of any nature; services connected with the exercise of ofﬁcial authority; activities of notaries and court ofﬁcers appointed by public authorities; audio-visual services. ▸ Again: many exclusions… ▸ BUT: Art. 3a UWG is excluded from penal consequences (thus only costly private trials…) Illegal Comparisons ▸ Comparisons that are based on untruths. e.g. promotion prices must not be measured against normal prices. ▸ Misleading comparative advertising, e.g. when non-comparable facts are compared. ▸ Unnecessarily degrading comparisons. ▸ Lean on advertising, e.g. „We’re the Rolls Royce among mineral waters!“ Misleading Advertisement Urteil Hornbach: \"Tiefstpreisgarantie!\" Epic Pepsi vs. Coke advertisement „battle“ https://www.youtube.com/watch?v=oWOG6PTs75s Same with Mac vs. PC or Verizon vs. AT&T etc. Use of", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 11, "page": 6}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_012", "text": "Misleading Advertisement Urteil Hornbach: \"Tiefstpreisgarantie!\" Epic Pepsi vs. Coke advertisement „battle“ https://www.youtube.com/watch?v=oWOG6PTs75s Same with Mac vs. PC or Verizon vs. AT&T etc. Use of unfair Terms and Conditions (Art. 8 UWG) „Anyone who uses general terms and conditions which, in breach of good faith, create a signiﬁcant and unjustiﬁed imbalance between contractual rights and contractual obligations to the detriment of consumers is acting illegal.“ ▸ Has little practical evidence. Couldn’t ﬁnd even in the EU a relevant case. Bribery and accepting bribes (Art. 4a UWG) „1 A person acts unfairly if they: a. offer, promise or grant an undue advantage to an employee, a company member, an agent or another auxiliary person of a third party in the private sector in connection with the latter's ofﬁcial or business activity in return for an act or omission in breach of the latter's duty or subject to their discretion for the former's beneﬁt or for the beneﬁt of a third party; b. as an employee, a company member, an agent or another auxiliary person of a third party in the private sector solicit the offer or promise of or accept an undue advantage in connection with their ofﬁcial or business activity in return for an act or omission in breach of their", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 12, "page": 7}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_013", "text": "third party; b. as an employee, a company member, an agent or another auxiliary person of a third party in the private sector solicit the offer or promise of or accept an undue advantage in connection with their ofﬁcial or business activity in return for an act or omission in breach of their duty or subject to their discretion for their own beneﬁt or for the beneﬁt of a third party. 2 Advantages contractually approved by the third party and minor, socially customary advantages are not undue advantages.” ▸ Be careful! If you offer or accept undue advantages you violate Art. 4a UWG! The penal consequences are now ruled under Art. 322octies ff StGB! If the advantages are not of minor value (< 1’000 CHF) the prosecution is ex ofﬁcio! Legal protection for violations of the unfair competition law („UWG“) ▸ Civil law claims (Art. 9 ff UWG): declaratory action, action for injunction, action for elimination, action for indication of origin, damages, satisfaction, proﬁt return, publication, precautionary measures Disadvantage: costly with a high ﬁnancial risk! ATTENTION! Art. 13a UWG: The judge may oblige the advertiser to reverse the burden of proof! The advertiser must then prove that their advertising is accurate! ▸ Criminal law claims (Art. 23 ff UWG): In the case", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 13, "page": 7}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_014", "text": "high ﬁnancial risk! ATTENTION! Art. 13a UWG: The judge may oblige the advertiser to reverse the burden of proof! The advertiser must then prove that their advertising is accurate! ▸ Criminal law claims (Art. 23 ff UWG): In the case of intent, prison and a ﬁne of up to CHF 100’000 upon request. In the case of professional commission of a crime, prosecution is ex ofﬁcio! Disadvantage: „cheap” but you don’t get ﬁnancial compensation! No legal authority, but... ▸ Advertising industry imposes itself to the industry rules („Best Practice“) of the Swiss Commission on Fair Trading („Lauterkeitskommission“ - www.faire-werbung.ch) ▸ Decisions of the Fairness Commission have no direct legal effect, but they do have a strong impact in the industry! Violations of \"stop-advertising stickers Sexism and advertisement… …not illegal but a violation of the „best practices” (Lauterkeitskommission). Legal or illegal?? ▸ Pls. check the claim: „We are always cheaper!“ ▸ Pls. check the claim: „CHEAPEST PIZZA in TOWN!“ ▸ Pls. check the sentence in a letter to the customers: „our newly updated school dictionary is much better than the dictionary of …“ ▸ The small", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 14, "page": 8}}
{"chunk_id": "Handout #10 Introduction in Unfair Competition Law_015", "text": "are always cheaper!“ ▸ Pls. check the claim: „CHEAPEST PIZZA in TOWN!“ ▸ Pls. check the sentence in a letter to the customers: „our newly updated school dictionary is much better than the dictionary of …“ ▸ The small dairy-producer „FrischMilch“ published in a Swiss newspaper the following advertisement: „Scandal - EMMI sells in America yoghurt with the label: „Made from fresh alpine milk“!“ The product is made in the USA. Legal or illegal? ▸ You buy addresses of potential new customers and send all them emails to advertise your new product. ▸ You run a cloud-based software. Telecom-Company X is a close business partner of you. But X is also a strong competitor of Company Y. You offer X to help them by „delaying“ all access coming from Telecom-Company Y. ▸ After quitting the job on company A you bring all your experience as engineer and also „some papers“ (construction plans) to your new employer.", "metadata": {"source": "Handout #10 Introduction in Unfair Competition Law", "chunk_index": 15, "page": 8}}
