{"chunk_id": "Handout #2 Essentials of Contract Law_000", "text": "PRIVACY & LAW SS 25 „ESSENTIALS“ CONTRACT LAW TOPICS ▸ The „Why” - Functions of Contracts ▸ Content of the Swiss Code of Obligations ▸ How to write contracts / Checklist / „Tailor-made“ or not? ▸ Offer and contract closure ▸ Formal requirements ▸ Typical cases of conﬂicts ▸ Delay ▸ Conﬂict management - escalation steps by Glasl ▸ Contracts in the technical ﬁeld ▸ Some Contracts (Work, Mandate, Employment) LEARNINGS ▸ You have to make the rule! (written law often doesn’t have an exact rule for your legal question) ▸ Be careful what you accept! All communication can be part of a contract! ▸ All what hasn’t been negotiated will be negotiated later… ▸ Reminder’s have important legal effects! ▸ You have to know whether it is a Work-Agreement, Service- or Employment-Agreement! ▸ Consider „ADR” (AlternativeDisputeResolution) in Conﬂicts! The „Why”: Functions of (written) contracts ▸ First: Negotiations and writing contracts enforces the parties to think & express how they want to cooperate! The important part is the discussion - not the signed paper! ▸ Note: Everything that is not negotiated at the beginning, will be negotiated again later - but then under different conditions... ▸ Agreements between parties by", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 0, "page": 1}}
{"chunk_id": "Handout #2 Essentials of Contract Law_001", "text": "writing contracts enforces the parties to think & express how they want to cooperate! The important part is the discussion - not the signed paper! ▸ Note: Everything that is not negotiated at the beginning, will be negotiated again later - but then under different conditions... ▸ Agreements between parties by e-mail, SMS, messenger, TEAMS (!), Jira, oral etc. can be enforced by law! All your writings might be essential in a court case! ▸ A contract is a proof of conclusion & content of legal transactions by means of witnesses, writing, seal, handwritten or (qualiﬁed) electronic signatures ▸ Contracts clarify what the parties really want(ed). If it’s not clear then the court will interpret the agreement! Often not in favour of both parties! ▸ Contracts establish foreseeable, uniform rules („standards“, Terms-of-Trade) for gap-ﬁlling and enforcement (legal framework) ▸ Facilitate (national/international) commercial transactions ▸ Protection of a party against unfair overreaching ▸ Contracts should have rules for conﬂict management - not only legal but also alternative dispute resolution (ADR - e.g. mediation) IN THE YEAR 25 OF THE 21th CENTURY… ▸ Legal transactions between globally distributed parties who do not know each other and might have different culture (quality, correct fulﬁllment etc.) create some practical & legal problems ▸ More and more", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 1, "page": 1}}
{"chunk_id": "Handout #2 Essentials of Contract Law_002", "text": "- e.g. mediation) IN THE YEAR 25 OF THE 21th CENTURY… ▸ Legal transactions between globally distributed parties who do not know each other and might have different culture (quality, correct fulﬁllment etc.) create some practical & legal problems ▸ More and more „license“-agreements” (online-services, SaaS, pay-per-use, workplace renting, car etc.) > not regulated in the CO! ▸ More and more „in-the-middle“-service-providers with „gate-keeper-functions“ (Apple, Google, MS, Steam etc.). EU- DigitalMarkedAct („DMA“) with restrictions to ensure fair marked. Has a strong impact worldwide (e.g. Apple - Epic Games). Be also careful with iPaaS („Integration Platform as a Service”) like Zapier, Make, n8n, Microsoft Power Automate, Automate.io, Workato etc.!! ▸ Often permanent contracts (online/cloud services/SaaS). What if there is no more access, no more support? Important data is then still accessible? Which service is the weakest in the production chain? > not regulated in the CO! ▸ Difﬁculties to check online service quality. What is „sufﬁcient“? > practical problem. Not regulated in the CO! ▸ Challenging performance, liability and enforcement issues (place of fulﬁllment & jurisdiction?). ▸", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 2, "page": 2}}
{"chunk_id": "Handout #2 Essentials of Contract Law_003", "text": "CO! ▸ Difﬁculties to check online service quality. What is „sufﬁcient“? > practical problem. Not regulated in the CO! ▸ Challenging performance, liability and enforcement issues (place of fulﬁllment & jurisdiction?). ▸ Agile/iterative project development needs a clear (also legal) framework - many projects/software matures only with the time (MVP - „Minimal Viable Product”) > not regulated in the CO! ▸ All legal & technical questions should be answered by globally valid regulations (laws)… NOPE! Solution: individual (tailor made) agreements! Rules for designing contracts ▸ KISS - keep it simple and stupid (but not too much!) ▸ Simple, clear, understandable (e.g. deﬁne terms) ▸ Think in terms of the (practical) process - logically step-by-step! What are the preconditions of the project? What is the aim? What are the duties of each party in the fulﬁlling-phase and what exactly are the rights of the parties if the service is not fulﬁlled... ▸ Think not only about the beginning (delivery, payment), but also about the end of the cooperation (exit clauses, obligations to cooperate in hosting and SaaS!). How exactly (!) do I get access to my data!?? ▸ \"Pacta sunt servanda\" vs. ﬂexibility &", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 3, "page": 2}}
{"chunk_id": "Handout #2 Essentials of Contract Law_004", "text": "about the beginning (delivery, payment), but also about the end of the cooperation (exit clauses, obligations to cooperate in hosting and SaaS!). How exactly (!) do I get access to my data!?? ▸ \"Pacta sunt servanda\" vs. ﬂexibility & changeability of the contractual relationship ▸ Tailor-made contracts or model contract? ▸ In (IT & other ﬁelds) often we have the construct „Terms and Conditions” or „Framework Agreement“ or „Base agreement” combined with a „side letter“ (individualisation) CHECKLIST ▸ Description of the parties and the aim of their agreement ▸ Speciﬁcation of the contract output ▸ Price, terms of payment ▸ Time and place of fulﬁlment ▸ Acceptance procedure ▸ Procedure in case of defects, rectiﬁcation of defects/failures ▸ Liability for defects/failures ▸ Contract duration - termination notice ▸ In many cases: how to migrate data & services at the end of the collaboration! ▸ Contractual penalty ▸ Secrecy, data protection ▸ Place of jurisdiction, applicable law „TAILOR-MADE-CONTRACT“ vs. MODEL CONTRACT No unreﬂected use of templates! ▸ Correct legal system? ▸ Comparability of the circumstances? ▸ Does the template also contain all relevant regulations? ▸ Have changes in the legal situation been taken into", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 4, "page": 2}}
{"chunk_id": "Handout #2 Essentials of Contract Law_005", "text": "„TAILOR-MADE-CONTRACT“ vs. MODEL CONTRACT No unreﬂected use of templates! ▸ Correct legal system? ▸ Comparability of the circumstances? ▸ Does the template also contain all relevant regulations? ▸ Have changes in the legal situation been taken into account? ▸ Embarrassing if names of previous parties or inferences to previous situations appear.... WHAT DO YOU FIND IN THE SWISS CODE OF OBLIGATIONS? „Fun-fact“: the CO is an addendum of the Swiss Civil Code! In many cases you have to check both! At the end of the ofﬁcial CO you ﬁnd the table of contents: ▸ General regulations (Art. 1-183 CO) about the closing of contract and tort, liability, fulﬁlling and non-fulﬁlling etc. ▸ Several types of contracts (Art. 184-551 CO) ▸ Commercial companies and the cooperatives (Art. 552-926) ▸ Commercial register, company names, accounting rules (Art. 927-964 CO) ▸ Securities (check, shares, debt securities etc.) ▸ But no or just rudimentary rules about qualiﬁed digital signature, licences or distributed ledger technology (blockchain)! The principle of „freedom of contract” is widely used! YOU have to make it right - not the law! General Topics: Offer & Contract Closure ▸", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 5, "page": 3}}
{"chunk_id": "Handout #2 Essentials of Contract Law_006", "text": "▸ But no or just rudimentary rules about qualiﬁed digital signature, licences or distributed ledger technology (blockchain)! The principle of „freedom of contract” is widely used! YOU have to make it right - not the law! General Topics: Offer & Contract Closure ▸ Art. 1 CO: A contract is concluded by mutual, concordant expression of will. This can take place expressly or implicitly. ▸ Offer = binding request to conclude the contract under certain conditions (price, quantity, etc.). = ? ▸ Acceptance = agreeing the offer. But be careful! A speciﬁc acting of a party might be regarded as binding acceptance! e.g. paying the bill, ▸ ATTENTION! Binding offer or only invitation to make an offer? (Art. 7 CO). The order process in online trading (webshops) is regularly \"only\" an invitation to make an offer. Therefore the customer places the offer and the seller accepts it. Terms and Conditions („AGB”) ▸ They have to placed in a way that the customer had to recognize them! Otherwise they don’t get part of the contract! ▸ Terms and Conditions are general rules. ANY individual agreement between the parties that differs (e.g. in e-mails, letters etc.), overrules as special rule the general rule! ▸ If two Terms and Conditions differs in certain points, the contract is most likely still valid. BUT in the different points the", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 6, "page": 3}}
{"chunk_id": "Handout #2 Essentials of Contract Law_007", "text": "and Conditions are general rules. ANY individual agreement between the parties that differs (e.g. in e-mails, letters etc.), overrules as special rule the general rule! ▸ If two Terms and Conditions differs in certain points, the contract is most likely still valid. BUT in the different points the CO is applicable. That might be costly for one of the parties… FORMAL REQUIREMENTS ▸ Contracts are in principle not bound to a form, unless this is required by law (Art. 11 CO). ▸ Levels: Informal - Simple written form - Qualiﬁed written form - Public certiﬁcation - Entry in a public register - Public certiﬁcation & entry in a public register. ▸ Good business professionals don’t have difﬁculties to have good (written) contracts! ▸ Note: If it gets „complicated“ produce „paper“ (evidences)! Typical cases of conflicts with contracts ▸ Non or too late delivery... ▸ Defective product/warranty services… ▸ Unclear acceptance procedure... ▸ Missing payment... ▸ Multiple parties involved in performance... ▸ Excessive binding ▸ Other defects (false explanation, voidness, impossibility, overreaching etc.) DELAY ▸ A difference is made between creditor- and debtor-delay (Art. 91/102 OR). ▸ Delay and reminder: normally only with explicit notice that the owed performance is now outstanding! ▸", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 7, "page": 4}}
{"chunk_id": "Handout #2 Essentials of Contract Law_008", "text": "defects (false explanation, voidness, impossibility, overreaching etc.) DELAY ▸ A difference is made between creditor- and debtor-delay (Art. 91/102 OR). ▸ Delay and reminder: normally only with explicit notice that the owed performance is now outstanding! ▸ Obligation to cooperate! Otherwise you may miss your rights of delay! (e.g. you will lose the contractual penalty…) ▸ Consequences of delay in general (Art. 103 ff OR), e.g. 5% default interest for ﬁnancial obligations. Reminding a party is an important legal process! ▸ Sets (timely) the beginning of default interest 5% p.a. (or more if agreed) ▸ Allows compensation for damages (if you can prove…) ▸ But you can only remind the other party if you are not in default yourself! formal REMINDER time we expect your fulfilling You’re too late! If a party doesn’t fulfill the contract… ▸ …he/she is liable for the damage! (Art. 97 ff CO) ▸ BUT: Art. 100 CO: „Any agreement purporting to exclude liability for unlawful intent or gross negligence in advance is void.” Or in other words: if you produce a damage in gross negligence - you’re liable despite excluding such in an agreement! ▸ Procedure: Art. 107 CO: you have to give another chance. If not fulﬁlling in", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 8, "page": 4}}
{"chunk_id": "Handout #2 Essentials of Contract Law_009", "text": "for unlawful intent or gross negligence in advance is void.” Or in other words: if you produce a damage in gross negligence - you’re liable despite excluding such in an agreement! ▸ Procedure: Art. 107 CO: you have to give another chance. If not fulﬁlling in that time you have the right that the contract will be fulﬁlled OR you have the right to terminate the contract. In both cases the non fulﬁlling party is liable for the (different) damage! CONTRACTS IN THE TECHNICAL FIELD Nominated contracts (are named in the Swiss C.O.) ▸ Sales contract ▸ Work- and supply of materials contract (to develop and deliver a product) ▸ Mandate/Services (consulting, installation, development, project management, SLA) ▸ Rental/lease contract ▸ Employment contract ▸ Composite contracts (IT: hosting, project implementation, development, licensing) ▸ …and some more… Innominate contracts (are not named in the Swiss C.O.) ▸ License contract ▸ Service Level Agreement (SLA) ▸ Agile Software development contract ▸ Real (industry) Leasing ▸ Factoring contract ▸ Escrow agreement Watch out these topics!! ▸ Look ﬁrst for a good relation and congruent understanding - then for the price! ▸ Contracts (for work) for a ﬁxed price! 🤦 If the customer want/has to", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 9, "page": 5}}
{"chunk_id": "Handout #2 Essentials of Contract Law_010", "text": "▸ Factoring contract ▸ Escrow agreement Watch out these topics!! ▸ Look ﬁrst for a good relation and congruent understanding - then for the price! ▸ Contracts (for work) for a ﬁxed price! 🤦 If the customer want/has to quit this contract he has to pay the full price! (Art. 377 CO) ▸ No exit-regulations in service-contracts! Then you possibly have to pay (insanely) extra for them! ▸ No delivery date ﬁxed! If so - and some problems occur in the realisation phase - the delivery could be way later than you thought! ▸ In development-projects: no actual & sufﬁcient documentation of the work (software, tasks, time etc.) ▸ In consulting contracts: no clear ending and no sufﬁcient documentation of the work (hours have to be speciﬁed!!) Some contracts: Work- and supply of materials agreement Contractor is obliged to create a work against payment. ▸ Determination of the price: ﬁxed price, according to effort or cost budget? What happens if the agreed price is exceeded? Well… ▸ Warranty obligations: Acceptance procedure of the work in agreed quality at the end. Warranty usually similar to purchase contract. If the work (e.g. software, machine etc.) is productively used = acceptance! ▸ Withdrawal and compensation: Does the customer have a right", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 10, "page": 5}}
{"chunk_id": "Handout #2 Essentials of Contract Law_011", "text": "Well… ▸ Warranty obligations: Acceptance procedure of the work in agreed quality at the end. Warranty usually similar to purchase contract. If the work (e.g. software, machine etc.) is productively used = acceptance! ▸ Withdrawal and compensation: Does the customer have a right of withdrawal (step back from contract)? Yes - but it might be costly… (Art. 377 CO) Some contracts: Mandate/Service Acting in the interest of the client. No speciﬁc result is owed! ▸ Can be terminated at any time (OR 404). ATTENTION! Does not apply, however, to \"atypical\" contracts if notice period agreed! (e.g. support contract) ▸ Responsibility of the contractor: He must document to the client what he has done and when within the scope of the mandate. ▸ Liability for acting in the interest of the client. But no liability for a certain success! Some contracts: Employment / labour law Differentiation from mandate, contract for work and services/supply, agency contract, simple partnership When is the labour law applicable if one is self-employed (contract for work and services) or pseudo-self-employed? Indications for employment relationship: ▸ regular and permanent activities for the same \"client\" ▸ Subordination in a project organisation of the \"client ▸ no bearing of entrepreneurial risks ▸ neither involved in customer acquisition nor in project management ▸ not responsible to the client for project execution", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 11, "page": 6}}
{"chunk_id": "Handout #2 Essentials of Contract Law_012", "text": "Indications for employment relationship: ▸ regular and permanent activities for the same \"client\" ▸ Subordination in a project organisation of the \"client ▸ no bearing of entrepreneurial risks ▸ neither involved in customer acquisition nor in project management ▸ not responsible to the client for project execution and possible deﬁciencies ▸ not carrying out claim collection ($) independently (in your favour) Labour law - typical questions (1) ▸ Formation: doesn’t have to be in written form, but… ▸ Chain contracts: some employers want to shift the business risk to the employees by several short term contracts in a row… Without due reasons that will be regarded as one contract. ▸ Temporary/permanent contracts: temporary contracts end automatically - permanent only with a termination letter. ▸ Salary, incentive salary, bonus, gratuity: differ between ﬁx salary, variable salary and gratuity. ▸ Overtime, compensation: Normally overtime has to be compensated with free time! ▸ Probationary period, termination: max 3 month, no prolongation except you’ve been ill, had an accident or you served (obligatory) in the army/civil service. ▸ Obligation to continue to pay the salary during illness, military, etc.: Art. 324a CO Labour Law - typical questions (2) ▸ Post-contractual non-competition agreements (geographical/factual/temporal limited. Max 3 years) ▸ Liability", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 12, "page": 6}}
{"chunk_id": "Handout #2 Essentials of Contract Law_013", "text": "service. ▸ Obligation to continue to pay the salary during illness, military, etc.: Art. 324a CO Labour Law - typical questions (2) ▸ Post-contractual non-competition agreements (geographical/factual/temporal limited. Max 3 years) ▸ Liability („culpa in eligendo, instruendo & custodiendo“) ▸ Duty of job reference. Must be complete, true and benevolently formulated ▸ Don’t forget the ArG („Arbeitsgesetz“ - applicability, health protection, working and rest times, family obligations) Conflicts are normal! But most could have solved without courts! ▸ Conﬂict-Management: if conﬂicts are normal then professionals should have a standardised „process” how they normally behave! ▸ As long as you are in respectful discussions the two (or more) parties can solve their issue independently and without a court! Therefore: keep a respectful communication alive! ▸ If the parties can’t solve their issue alone - consider a Mediation / neutral Consultant to reestablish the respectful communication! ▸ Most likely a mediation is cheaper & faster than a court proceeding! Non legal Conflict Management (Mediation): Escalation steps by Friedrich Glasl MY TAKE AWAY… ▸ … ▸ … ▸ … ▸ …", "metadata": {"source": "Handout #2 Essentials of Contract Law", "chunk_index": 13, "page": 7}}
